Revit 2024 API
ScheduleDefinition.AreaSchemeId Property
 In an area schedule, the ID of the area scheme to display.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId AreaSchemeId { get; }
Visual Basic
Public ReadOnly Property AreaSchemeId As ElementId
	Get
Visual C++
public:
property ElementId^ AreaSchemeId {
	ElementId^ get ();
}
Remarks
Schedules of the Areas category show area elements belonging to a single area scheme.
Key schedules of the Areas category apply to all area schemes, so they don't have an area scheme ID.
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace